poiseuillePlano/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/globalVariables"


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($Um 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform ($Um 0 0);
    }

    outlet
    {
        type            zeroGradient;
        //value           uniform (0 0 0);
    }//*/

    //outlet
    //{
    //    type            inletOutlet;
    //    inletValue      uniform (1 0 0); // Value applied if backflow occurs
    //}

    centreline
    {
        type symmetryPlane;
    }

}

// ************************************************************************* //
