poiseuillePlano/constant/fvAAAModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/globalVariables"


momentumSource
{
    type            semiImplicitSource;

    cellZone        all;

    volumeMode      specific;

    sources
    {
        U
        {
            explicit    (#calc "3 * $Um /2" 0 0);
            implicit    0;
        }
    }
}


// ************************************************************************* //
