poiseuillePlano/constant/globalVariables
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      globalVariables;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Re	100;
vc	0.01;
H	1.0;
L   #calc "10 * $H";

// You can also calculate derived values using the #eval directive
Um           #calc "$Re * $vc / $H"; // Example: U = Re * nu / L

