poiseuillePlano/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals(p, U)
#includeFunc graphCell(name=graph0, start=(0.02 0 0), end=(0.02 1 0), U)
#includeFunc graphCell(name=graph1, start=(1.00 0 0), end=(1.00 1 0), U)
#includeFunc graphCell(name=graph2, start=(2.00 0 0), end=(2.00 1 0), U)
#includeFunc graphCell(name=graph3, start=(3.00 0 0), end=(3.00 1 0), U)
#includeFunc graphCell(name=graph4, start=(4.00 0 0), end=(4.00 1 0), U)
#includeFunc graphCell(name=graph5, start=(5.00 0 0), end=(5.00 1 0), U)
#includeFunc graphCell(name=graph6, start=(5.98 0 0), end=(5.98 1 0), U)
#includeFunc probes(name=probes, points=((0 1 0)), U)

// ************************************************************************* //
